app/controllers/tags_controller.rb

	def index
		@tags = Tag.find :all
---
SELECT * FROM `tags`

	def show
		@tag = Tag.find_by_name(params[:id])
		@videos = Video.paginate_by_id(Video.find_tagged_with(@tag), :page => params[:page], :per_page => 10)
---
SELECT * FROM `tags` WHERE (`tags`.`name` = '1') LIMIT 1
SELECT * FROM `videos` WHERE (`videos`.`id` IN (18)) LIMIT 0, 10
SELECT tags.id, tags.name, COUNT(*) AS count FROM `tags` INNER JOIN taggings ON tags.id = taggings.tag_id INNER JOIN videos ON videos.id = taggings.taggable_id WHERE (taggings.taggable_type = 'Video') GROUP BY tags.id, tags.name HAVING COUNT(*) > 0