app/controllers/users_controller.rb

INSERT INTO `users` (`last_request_at`, `created_at`, `crypted_password`, `updated_at`, `current_login_ip`, `password_salt`, `current_login_at`, `persistence_token`, `login_count`, `last_login_ip`, `login`, `last_login_at`) VALUES('2009-03-29 09:04:44', '2009-03-29 09:04:44', '3572969450061bba45e9d6e95af9496cfec83275b8ea4c16da4eaf48236d9e4feee0aeea3f8c3b33c07f849c795d70ca3ad1660a2e21e486790377c1cc121cb8', '2009-03-29 09:04:44', '127.0.0.1', 'XeFHjV4rxGxw9nOMpDOO', '2009-03-29 09:04:44', 'e3fb73ff0315384ed45f590197a5c77487c5bd709edf290297dbd46bae2970830a0c7fd51cad86a1533845fb4f617ed2c8d35857f1d319a639a598e3284e5718', 1, NULL, 'rledge21', NULL)
---
  def create
    @user = User.new(params[:user])

    if @user.save

UPDATE `users` SET `updated_at` = '2009-03-29 09:05:27', `crypted_password` = 'dfac0c2a289121303706ab4179a366b1a848658b29490bc45a0aeb0741d1f9635c1a2b83b8c897f956f3fcf3a69ea6de1c42eb408314ac9f84c9dac6e88334e6', `last_login_at` = '2009-03-29 09:04:44', `last_login_ip` = '127.0.0.1', `current_login_at` = '2009-03-29 09:05:27', `password_salt` = '485MgS6OA71QZ8IuLOhk', `login_count` = 2, `persistence_token` = '40b6db4cba12b738dd793c2cfc2328b6427fadae453c1ac3652a692c04b75ed912d527c59494f0fd328d101d243d8d56fe8cfab567e8e1100b42196018082f8b', `last_request_at` = '2009-03-29 09:05:27' WHERE `id` = 1
---
  def update
    @user = @current_user
      if @user.update_attributes(params[:user])