app/controllers/video_replies_controller.rb

	def create
		@reply = VideoReply.new(params[:video_reply])
		if @reply.save
---
INSERT INTO `video_replies` (`created_at`, `body`, `video_id`, `updated_at`, `user_id`, `parent_id`) VALUES('2009-03-29 11:06:51', 'Great Vid!\r\n', NULL, '2009-03-29 11:06:51', 1, NULL)