app/controllers/videos_controller.rb

SELECT * FROM `videos` ORDER BY created_at DESC LIMIT 0, 10
SELECT count(*) AS count_all FROM `videos`
---
  def index
    @videos = Video.paginate :page => params[:page], :order => 'created_at DESC', :per_page => 10

INSERT INTO `videos` (`size`, `created_at`, `content_type`, `title`, `updated_at`, `thumbnail_id`, `filename`, `description`, `state`) VALUES(24399360, '2009-03-17 18:44:54', 'video/x-msvideo', 'TestVid', '2009-03-17 18:44:54', 1, 'baseball.demo.avi', 'woot', 'pending')
---
  def create
    @video = Video.new(params[:video])
    if @video.save

SELECT * FROM `videos` WHERE (`videos`.`id` = 2)
---
  def show
    @video = Video.find(params[:id])